{
  "home_title": "Accueil",
  "status": "Étudiant développeur",
  "aboutme": "À propos",
  "aboutme_text": "Développeur passionné par la technologie, l'innovation et le spatial, j'ai développé rigueur et esprit d'équipe lors d'un parcours atypique en cuisine avant de me réorienter vers l'informatique. Cette expérience m'a appris l'adaptabilité, la résolution de problèmes complexes et l'exigence d'excellence. Aujourd'hui, je mets cette polyvalence et cette curiosité au service du développement, avec un intérêt particulier pour les projets à fort impact technologique.",
  "cv": "Télécharger mon CV",
  "show_more": "Voir plus",
  "show_less": "Voir moins",
  "projects_title": "Projets",
  "skills_title": "Compétences",
  "experiences_title": "Expériences",
  "contact_title": "Contact",

  "projects_details": "Détail du projet",
  "projects_skills": "Compétences liées",
  "projects_skills_button": "Détail Compétences",

  "projects": [
    {
      "title": "AppliParam – Développement et évolution d’un logiciel de paramétrage de centrale incendie",
      "description": "Projet réalisé lors d’un stage chez Desautel : amélioration et développement de nouvelles fonctionnalités sur un logiciel de paramétrage de centrales incendie. Conception d’interfaces WPF, gestion des données, mise en place du patron Observer, migration vers .NET 9, tests unitaires et documentation.",
      "tags": ["C#", ".NET9", "WPF", "Design Patterns", "Git", "Entreprise"],
      "details": "Au sein de l’équipe R&D de Desautel, j’ai participé à l’évolution d’un logiciel métier critique : refonte d’interfaces en WPF, ajout de modules de gestion des paramètres, amélioration de la robustesse du code (Observer), migration technique vers .NET 9, rédaction de tests unitaires et documentation technique. Collaboration avec les équipes QA et support.",
      "images" : ["/projects/AppliParam.png"],
      "competences": [
        {
          "code": "C1.3",
          "sousCompetence": "Réaliser (Niveau 3) : Adapter des applications sur des supports variés",
          "justification": "Refonte d'un logiciel métier en C#/.NET avec WPF, intégration de design patterns (Observer). Relié à AC21.01 (évolution d'applications existantes) et AC11.04 (IHM)."
        },
        {
          "code": "C2.3",
          "sousCompetence": "Optimiser (Niveau 3) : Analyser et optimiser des applications",
          "justification": "Migration vers .NET 9, optimisation des performances et robustesse. Correspond à AC22.02 (techniques algorithmiques avancées) et AC22.04 (impact environnemental)."
        },
        {
          "code": "C6.2",
          "sousCompetence": "Collaborer (Niveau 2) : Situer son rôle dans une équipe",
          "justification": "Collaboration avec les équipes R&D, documentation technique. Alignement avec AC26.01 (diversité des rôles en entreprise) et AC26.04 (communication professionnelle)."
        }
      ]
    },
    {
      "title": "SmartDesk – Application de gestion d’agenda et de productivité",
      "description": "SmartDesk est une application web moderne développée avec Svelte, dédiée à l'organisation personnelle et à la gestion de la productivité. Elle propose un calendrier interactif, un gestionnaire de tâches, un module de prise de notes et l'intégration de widgets musicaux, le tout dans une interface responsive et intuitive.",
      "tags": ["HTML", "CSS", "JavaScript", "Svelte", "Node.js", "TailwindCSS", "GitHub", "Git", "MySQL", "VPS"],
      "details": "Conception et développement d'une application web complète (Svelte/Node.js) répondant à un cahier des charges, avec gestion du cycle de vie (analyse, tests, déploiement). Alignement avec AC11.01 (implémentation), AC11.02 (conception) et AC11.03 (tests).",
      "images" : ["/projects/SmartDesk.png"],
      "competences": [
        {
          "code": "C4.2",
          "sousCompetence": "Gérer (Niveau 2) : Optimiser une base de données",
          "justification": "Modélisation et optimisation d'une base de données MySQL pour la gestion des utilisateurs/tâches, avec requêtes SQL sécurisées. Correspond à AC14.03 (conception BD) et AC25.01 (manipulation de données)."
        },
        {
          "code": "C3.2",
          "sousCompetence": "Administrer (Niveau 2) : Déployer des services dans une architecture réseau",
          "justification": "Déploiement sur VPS (configuration Node.js, sécurité, automation). Couvre AC20.02 (services réseaux) et AC13.04 (configuration poste de travail étendue)."
        }
      ]
    },
    {
      "title": "PanierVIP – Site de gestion de liste de courses",
      "description": "Application web réalisée avec PHP et Symfony permettant la gestion collaborative de listes de courses : création de comptes, gestion de paniers, partage et suivi des achats en temps réel.",
      "tags": ["PHP", "Symfony", "Twig", "HTML", "CSS", "MySQL", "GitHub"],
      "details": "Conception et développement d’un site web complet : authentification, gestion des utilisateurs, création et partage de listes, gestion des rôles, interface responsive, persistance des données en MySQL. Projet individuel avec documentation et versionnage sur GitHub.",
      "images" : ["/projects/PanierVIP.png"],
      "competences": [
        {
          "code": "C1.1",
          "sousCompetence": "Réaliser (Niveau 1) : Développer des applications simples",
          "justification": "Développement PHP/Symfony avec gestion CRUD et authentification. Couvre AC11.01 et AC11.03."
        },
        {
          "code": "C4.1",
          "sousCompetence": "Gérer (Niveau 1) : Concevoir une base de données",
          "justification": "Modélisation MySQL et intégration ORM Symfony. Relié à AC14.03."
        },
        {
          "code": "C3.2",
          "sousCompetence": "Administrer (Niveau 2) : Déployer des services",
          "justification": "Mise en ligne et sécurisation (hébergement, gestion sessions). Correspond à AC20.02."
        }
      ]
    },
    {
      "title": "LootBoxHunter – Application mobile d’ouverture de caisses de cosmétiques",
      "description": "Application mobile Android développée en Kotlin permettant de simuler l’ouverture de caisses de cosmétiques, récupération des données via une API, stockage et authentification avec Firebase.",
      "tags": ["Kotlin", "Android Studio", "Firebase", "API REST", "UI/UX"],
      "details": "Réalisation d’une application mobile : conception de l’interface sous Android Studio, récupération asynchrone des données d’une API, gestion des utilisateurs et stockage cloud via Firebase, mise en place de notifications et gestion des états de connexion.",
      "images" : ["/projects/LootBoxHunter.png"],
      "competences": [
        {
          "code": "C1.3",
          "sousCompetence": "Réaliser (Niveau 3) : Adapter des applications (mobile)",
          "justification": "Développement Kotlin avec Firebase, respect des guidelines UI/UX. Alignement avec AC21.01 et AC11.04."
        },
        {
          "code": "C4.2",
          "sousCompetence": "Gérer (Niveau 2) : Manipuler des données hétérogènes",
          "justification": "Intégration Firebase (données cloud/authentification). Couvre AC25.04."
        },
        {
          "code": "C3.4",
          "sousCompetence": "Administrer (Niveau 3) : Sécuriser les applications",
          "justification": "Gestion des accès et données sécurisées (Firebase Auth). Relié à AC23.03."
        }
      ]
    },
    {
      "title": "DimensionalMatrix – Jeu Python sur Raspberry Pi et SenseHat",
      "description": "Développement d’un jeu interactif sur Raspberry Pi 3 utilisant la matrice de LEDs et les capteurs du SenseHat : le joueur contrôle un point lumineux dans un labyrinthe grâce au gyroscope.",
      "tags": ["Python", "Raspberry Pi", "SenseHat", "Jeu", "Gyroscope", "LED Matrix"],
      "details": "Conception d’un jeu en Python exploitant les fonctionnalités du SenseHat : affichage sur matrice de LEDs, utilisation du gyroscope pour déplacer le joueur, gestion des collisions et des niveaux, optimisation pour le hardware embarqué.",
      "images" : ["/projects/DimensionalMatrix.png"],
      "competences": [
        {
          "code": "C1.4",
          "sousCompetence": "Réaliser (Niveau 3) : Adapter des applications (embarqué)",
          "justification": "Programmation Python pour SenseHat (contraintes matérielles). Correspond à AC21.01."
        },
        {
          "code": "C2.3",
          "sousCompetence": "Optimiser (Niveau 2) : Sélectionner des algorithmes adaptés",
          "justification": "Optimisation pour Raspberry Pi (limitations hardware). Alignement avec AC22.02."
        }
      ]
    },
    {
      "title": "SAE JAVA – Visualisation de graphes et évitement de collision d’avions",
      "description": "Application Java Swing de création, coloration et visualisation de graphes modélisant l’espace aérien et l’évitement de collision d’avions en France.",
      "tags": ["Java", "Swing", "Graphe", "Algorithmes", "Interface graphique", "GitHub"],
      "details": "Développement d’une application Java : modélisation de graphes, algorithmes d’évitement de collision, interface graphique interactive, gestion des événements et des couleurs, documentation et gestion de projet sur GitHub.",
      "images" : ["/projects/SAE_JAVA.png"],
      "competences": [
        {
          "code": "C2.2",
          "sousCompetence": "Optimiser (Niveau 2) : Utiliser des structures de données complexes",
          "justification": "Algorithmes de graphes pour l'évitement de collisions. Couvre AC22.01."
        },
        {
          "code": "C6.1",
          "sousCompetence": "Collaborer (Niveau 1) : Travailler en équipe",
          "justification": "Gestion de projet GitHub et documentation. Relié à AC16.04."
        }
      ]
    }
  ],

  "form": {
    "name": "Nom",
    "company": "Entreprise",
    "email": "Email",
    "object": "Objet",
    "message": "Message",
    "submit": "Envoyer",
    "success": "Message envoyé avec succès !",
    "error": "Erreur lors de l'envoi du message.",
    "unknown_error": "Une erreur s'est produite."
  },

  "skills": {
    "title": "Compétences",
    "filter": "Filtrer",
    "categories": {
      "All": "Toutes",
      "Front-End": "Front-End",
      "Back-End": "Back-End",
      "DataBase": "Base de données",
      "Frameworks": "Frameworks",
      "Tools": "Outils"
    }
  },

  "experiences": {
    "title": "Expériences",
    "seeMore": "Voir plus",
    "seeLess": "Voir moins",
    "items": [
      {
        "title": "Desautel - Stage développement logiciel",
        "date": "AVRIL 2025 - JUILLET 2025",
        "description": "Développement logiciel de gestion de centrale incendie en C# .NET5/9.",
        "tags": ["C#", ".NET"]
      },
      {
        "title": "Stages cuisine",
        "date": "SEPTEMBRE 2018 - JUIN 2021",
        "description": "Stages de formation en cuisine (Perpignan, Nice, Chambéry, Grésy-Sur-Aix, Les Ménuires, ...)",
        "tags": ["Travail d'équipe", "Organisation", "Gestion du stress"]
      }
    ]
  },

  "skillsModal": {
    "title": "Détails des Compétences",
    "close": "Fermer",
    "competencies": [
      {
        "code": "C1",
        "label": "Réaliser un développement d'application",
        "description": "Concevoir, coder, tester et intégrer une solution informatique pour un client."
      },
      {
        "code": "C2",
        "label": "Optimiser des applications informatiques",
        "description": "Proposer des applications informatiques optimisées selon des critères spécifiques (temps d'exécution, précision, consommation de ressources, etc.)."
      },
      {
        "code": "C3",
        "label": "Administrer des systèmes informatiques communicants complexes",
        "description": "Installer, configurer, maintenir et optimiser des infrastructures, services et réseaux informatiques."
      },
      {
        "code": "C4",
        "label": "Gérer des données de l'information",
        "description": "Concevoir, gérer, administrer et exploiter les données de l'entreprise pour fournir les informations nécessaires au pilotage."
      },
      {
        "code": "C5",
        "label": "Conduire un projet",
        "description": "Organiser, piloter et gérer un projet informatique en mobilisant des méthodes adaptées et en coordonnant une équipe."
      },
      {
        "code": "C6",
        "label": "Travailler dans une équipe informatique",
        "description": "Collaborer efficacement au sein d'une équipe, communiquer, partager des connaissances et adopter une posture professionnelle."
      }
    ]
  },
  "passions": {
    "title": "Passions",
    "passion": [
      {
        "title": "Gaming",
        "description": "Passionné de jeux vidéo compétitifs, j’ai développé au fil du temps un véritable esprit d’analyse, de stratégie et de travail en équipe, notamment sur des titres comme *Rainbow Six Siege*. Le jeu vidéo est pour moi un moyen d’épanouissement, de rencontres et d’expériences uniques. Ces moments m’ont permis de gagner en confiance, en maturité, en rigueur et en méthodologie."
      },
      {
        "title": "Espace",
        "description": "Ma passion pour l’espace est née d’une quête de connaissance et d’un émerveillement devant les sciences. Bien qu’elle ne remonte pas à l’enfance, elle s’est imposée à moi comme une évidence. L’exploration et la compréhension de l’univers, de la vie, ainsi que les technologies associées (lanceurs, sondes, etc.) me fascinent. Cette passion m’accompagne partout et nourrit mon ambition d’avoir un jour un impact positif à travers un métier lié à ce domaine, en contribuant à l’avenir de l’humanité et de la planète."
      },
      {
        "title": "Sport automobile",
        "description": "Mon intérêt pour le sport automobile s’est construit progressivement, à mesure que je me passionnais pour l’ingénierie, la compétition et le sport. La Formule 1 m’a servi de porte d’entrée vers tout l’univers du sport auto. Aujourd’hui, je rêve de pouvoir pratiquer cette discipline en loisir, mais aussi, pourquoi pas, d’y travailler un jour, aux côtés des ingénieurs et des pilotes."
      },
      {
        "title": "SimRacing",
        "description": "En 2021, j’ai commencé à m’investir dans la simulation automobile, poussée par ma passion pour le sport auto. Je possède aujourd’hui un simulateur complet, qui me permet de développer des compétences telles que la concentration, le sang-froid, les réflexes, l’instinct et le pilotage de précision. Le SimRacing est une discipline exigeante, qui m'incite constamment à repousser mes limites et à viser l’excellence pour battre mes adversaires."
      },
      {
        "title": "Cuisine",
        "description": "Titulaire d’un Bac Professionnel Cuisine avec mention Très Bien, j’ai appris à travailler en équipe, à faire preuve de rigueur et à m’adapter à des situations imprévues. Cette expérience intense m’a permis de développer une excellente gestion du stress, une organisation solide et un esprit de collaboration. Ces compétences sont pleinement transférables dans le domaine de l’informatique. Cette aventure reste inoubliable, tant pour les valeurs que j’y ai découvertes que pour les personnes que j’ai rencontrées."
      },
      {
        "title": "Informatique",
        "description": "Ma passion pour l’informatique est née très tôt, en lien avec mon intérêt pour les jeux vidéo et la technologie. J’ai toujours été curieux de comprendre le fonctionnement des machines et des programmes, ce qui m’a donné une certaine aisance naturelle avec ces outils. Après des études en cuisine, j’ai décidé de réorienter mon parcours vers l’informatique en obtenant un Bac STI2D option Énergie et Environnement. Ce diplôme m’a permis de découvrir l’électricité, l’ingénierie, la mécanique et la programmation. Lors des projets, je choisissais systématiquement de travailler sur la programmation autonome des robots plutôt que sur leur conception physique. Résolution de problèmes, prototypage, tests : tout m’a passionné. C’est donc tout naturellement que j’ai choisi de poursuivre mes études dans le développement informatique. Aujourd’hui, je suis en deuxième année de BUT Informatique, spécialité développement d’applications, et je suis profondément passionné par ce que je fais."
      }
    ]
  }
}

